#define _CRT_SECURE_NO_WARNINGS 1
//// C语言入门编程100题

// NO.01
//# include <stdio.h> 

//// 1 2 3 4 个数字组成多少个互不相同的无重复的三位数字   分别是多少
//int main()
//{
//	int i, j, k;  // 定义三个变量
//	int a = 0;  //计数
//	printf("\n"); //打印空行
//	for (i = 1; i <= 4; i++)  // 以下为三重循环
//	{
//		for (j = 1; j <= 4; j++)
//		{
//			for (k = 1; k <= 4; k++)
//			{
//				if (i != k && i != j && j != k)  // 确保i、j、k三位互不相同
//				{
//					printf("%d %d %d\n",i ,j,k);
//					a++;  // 打印一次 自增1
//					
//				}
//			}
//		}
//	}
//	printf("一共有%d组\n", a);  // 打印总数
//	return 0;
//}

// NO.02
#include <stdio.h>

 //企业发放的奖金根据利润提成。 从键盘输入当月利润I，求应发放奖金总数？
//利润(I)低于或等于10万元时，奖金可提10% ；
//利润高于10万元，低于20万元时，低于10万元的部分按10% 提成，高于10万元的部分，可提成7.5 % ；
//20万到40万之间时，高于20万元的部分，可提成5 % ；
//40万到60万之间时高于40万元的部分，可提成3 % ；
//60万到100万之间时，高于60万元的部分，可提成1.5 % ；
//高于100万元时，超过100万元的部分按1 % 提成

int main()
{
	double I;  //当月近利润
	double  Bouns, Bouns1, Bouns2, Bouns4, Bouns6, Bouns10;  // 6个不同的类别的提成策略
	Bouns = 1;
	printf("输入你当月的利润：<");
	scanf("%lf", &I);
	Bouns1 = 100000 * 0.1;  //  低于等于 10万 的奖金
	Bouns2 = Bouns1 + 100000 * 0.075;  // 高于10万 低于20万的奖金  =  低于10万的奖金 +  高出10万部分的奖金
	Bouns4 = Bouns2 + 200000 * 0.05;
	Bouns6 = Bouns4 + 200000 * 0.03;
	Bouns10 = Bouns6 + 400000 * 0.015;
	
	if (I <= 100000)
	{
		Bouns = I * 0.1;  //利润低于10万的  奖金=  利润*10%
	}
	else if (I <= 200000)
	{
		Bouns = Bouns1 + (I - 100000) * 0.075;  // 低于等于10万的奖金加上    高出的部分 提成 7.5%  
		
	}
	else if (I <= 400000)
	{
		Bouns = Bouns2 + (I - 200000) * 0.05;
	}
	else if (I < 600000)
	{
		Bouns = Bouns4 + (I - 400000) * 0.03;
	}
	else if (I <= 1000000)
	{
		Bouns = Bouns6 + (I - 600000) * 0.015;
	}
	else if (I > 1000000)
	{
		Bouns = Bouns10 + (I - 1000000) * 0.01;
	}
	printf("你的奖金为：%lf\n",Bouns);
	return 0;
}